/**
 * Created by IFatkullina on 26.09.2018.
 * Пример: Методы оплаты в интернет магазине
 В этом примере Стратегия реализует выбор платёжного
 метода в интернет магазине. Когда пользователь сформировал
 заказ, он получает выбор из нескольких платёжных
 стредств: электронного кошелька или кредитной карты.

 В данном случае конкретные стратегии платёжных
 методов не только проводят саму оплату, но и собирают
 необходимые данные на форме заказа.
 */
package designPatterns.behavioral.strategy.examples_1;