/**
 * Функции округления:

 abs() - возвращает абсолютное значение аргумента
 ceil() - возвращает наименьшее целое число, которое больше аргумента
 floor() - возвращает наибольшее целое число, которое меньше или равно аргументу
 max() - возвращает большее из двух чисел
 min() - возвращает меньшее из двух чисел
 nextAfter() - возвращает следующее значение после аргумента в заданном направлении
 nextUp() - возвращает следующее значение в положительном направлении
 rint() - возвращает ближайшее целое к аргументу
 round() - возвращает аргумент, округлённый вверх до ближайшего числа
 ulp() - возвращает дистанцию между значением и ближайшим большим значением
 */
package math;